src/DataProcessors/Кассир/Кассир.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Кассир</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФильтр</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентФильтр</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДСФильтр</name>
    <type>
      <types>CatalogRef.СтатьяДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Остатки</name>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаГривна</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаГривнаОтменен</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаГривнаПлан</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДолларОтменен</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДолларПлан</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЕвро</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЕвроОтменен</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЕвроПлан</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Приход</name>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>EnumRef.ВидОперацииПриходныйКассовыйОрдер</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДолгПоВалютам</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийЗаполнен</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>8</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеПлатежа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ссылка</name>
      <type>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьяДДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаГривна</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЕвро</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расход</name>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>EnumRef.ВидОперацииРасходныйКассовыйОрдер</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДолгПоВалютам</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийЗаполнен</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>8</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеПлатежа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ссылка</name>
      <type>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьяДДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаГривна</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЕвро</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/Catalogs/Валюты/Валюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Валюты</name>
  <predefined>
    <items>
      <name>Гривна</name>
      <description>Гривна</description>
    </items>
    <items>
      <name>Доллар</name>
      <description>Доллар</description>
    </items>
    <items>
      <name>Евро</name>
      <description>Евро</description>
    </items>
  </predefined>
  <attributes>
    <name>КодЧисловой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСимвольный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/Кассир/Forms/Конвертация/Module.bsl
&НаКлиенте
Процедура КомандаОК ( Команда )
	
	отказ = Ложь;
	Если ( ЗначениеЗаполнено ( ВалютаПриход ) ) Тогда
		// код ...	
	Иначе
		Сообщить ( "Не заполнено поле ""Валюта приход""!", СтатусСообщения.Важное );   
		отказ = Истина;
	КонецЕсли;
	Если ( ЗначениеЗаполнено ( ВалютаРасход ) ) Тогда
		// код ...	
	Иначе
		Сообщить ( "Не заполнено поле ""Валюта расход""!", СтатусСообщения.Важное );   
		отказ = Истина;
	КонецЕсли;
	Если ( отказ ) Тогда
		Возврат;
	КонецЕсли; 
	п = Новый Структура ();
	п.Вставить ( "ВалютаРасход", ВалютаРасход );
	п.Вставить ( "ВалютаПриход", ВалютаПриход );
	п.Вставить ( "Курс", Курс );
	п.Вставить ( "СуммаРасход", СуммаРасход );
	п.Вставить ( "СуммаПриход", СуммаПриход );
	Закрыть ( п );
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриходПриИзменении ( Элемент )
	
	Если ( ВалютаПриход = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) ) Тогда
		ВалютаРасход = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" );
	ИначеЕсли ( ВалютаПриход = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) ) Тогда
		ВалютаРасход = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" );
	ИначеЕсли ( ВалютаПриход = ПредопределенноеЗначение ( "Справочник.Валюты.Евро" ) ) Тогда
		ВалютаРасход = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" );
	КонецЕсли; 
	рассчитатьСуммаРасход ();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриходПриИзменении ( Элемент )
	
	рассчитатьСуммаРасход ();
	
КонецПроцедуры

&НаКлиенте
Процедура КурсПриИзменении ( Элемент )
	
	рассчитатьСуммаРасход ();
	
КонецПроцедуры

&НаКлиенте
Процедура рассчитатьСуммаРасход ()
	
	Если ( Курс <> 0 ) Тогда
		Если ( ВалютаПриход = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) ) Тогда
			СуммаРасход = СуммаПриход / Курс;			
		ИначеЕсли ( ВалютаПриход = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) ) Тогда
			СуммаРасход = СуммаПриход * Курс;			
		ИначеЕсли ( ВалютаПриход = ПредопределенноеЗначение ( "Справочник.Валюты.Евро" ) ) Тогда
			СуммаРасход = СуммаПриход * Курс;			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВалютаРасходПриИзменении ( Элемент )
	
	Если ( ВалютаРасход = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) ) Тогда
		ВалютаПриход = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" );
	ИначеЕсли ( ВалютаРасход = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) ) Тогда
		ВалютаПриход = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" );
	ИначеЕсли ( ВалютаРасход = ПредопределенноеЗначение ( "Справочник.Валюты.Евро" ) ) Тогда
		ВалютаПриход = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" );
	КонецЕсли;
	рассчитатьСуммаПриход ();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаРасходПриИзменении ( Элемент )
	
	рассчитатьСуммаПриход ();
	
КонецПроцедуры

&НаКлиенте
Процедура рассчитатьСуммаПриход ()
	
	Если ( Курс <> 0 ) Тогда
		Если ( ВалютаРасход = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) ) Тогда
			СуммаПриход = СуммаРасход / Курс;			
		ИначеЕсли ( ВалютаРасход = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) ) Тогда
			СуммаПриход = СуммаРасход * Курс;			
		ИначеЕсли ( ВалютаРасход = ПредопределенноеЗначение ( "Справочник.Валюты.Евро" ) ) Тогда
			СуммаПриход = СуммаРасход * Курс;			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
